import random
A = [random.randint(-10, 10) for i in range(8)]
print("1.1 Список A:", A)


print("1.2) 5-ий елемент: ", A[4])
print("1.2) 7-ий елемент: ", A[6])
print("1.2) 2-ий - 6-ий елементи: ", A[1:6])




print("Завдання 1.3 всі елементи отриманого списку , починаючи з першого, з кроком 2 зліва направо: ",A[::2])


print("Завдання 1.4: всі елементи отриманого списку А, починаючи з останнього, з кроком 3 справа наліво. ",A[::-3])




A.extend([random.randint(-10, 10), random.randint(-10, 10)])
print("1.5: ) Додати два довільних елементи у список А. Новий список: ", A)




B = [random.randint(-10, 10) for i in range(3)]
A.extend(B)
print("1.6: ) Створити новий список В і об’єднати його з А. Новий список : ", A)


C = [random.randint(-10, 10) for i in range(5)]
A.append(C)
print("1.7: ) Список після додавання C:", A)

A.insert(3, 100)
print("1.8: )В позицію 3 вставити елемент 100. Список A:", A)

del A[-2:]
print("1.9: ) Список після видалення двох останніх елементів:", A)

print("1.10 Визначити індекс елемента 100 у списку А.: ",A.index(100))

print("1.11 Визначити, чи є в списку А елемент 2: ",2 in A)

print("1.12 Визначити, скільки разів в списку А зустрічається елемент 100: ",A.count(100))
print("1.12 Визначити, скільки разів в списку А зустрічається елемент 5: ", A.count(5))


A = [x for x in A if isinstance(x, int)]  
A.sort()
print("1.13) Список A після сортування за зростанням:", A)

A.reverse()
print("1.14) Список A в оберненому порядку:", A)

D = A.copy()
print("1.15) Список D:", D)

random.shuffle(D)
print("1.16) Перемішати елементи списку D випадковим чином. Список D :", D)

E = random.sample(A, 3)
print("1.17)Створити список Е із випадкових 3 елементів списку А. Список E:", E)